package com.tony;

import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;

/**
 * @author jiangwj20966 2018/9/10
 */
public class ResultResolver {
    public static void main(String[] args) {
        String result = "{\"log_id\":6279013633866701363,\"words_result\":[{\"words\":\"673K/s8川4G州画61%\"},{\"words\":\"微博正文\"},{\"words\":\"乡村教师代言人-马云\"},{\"words\":\"9-101042来自微博webo.com\"},{\"words\":\"各位阿里巴巴的客户、阿里人、阿里巴巴的股东们\"},{\"words\":\"是阿里巴巴19午。我怀着激动的心情向大家\"},{\"words\":\"宣布:经茸事会批准,一年后的今天,也就是2019年9\"},{\"words\":\"月10日,阿里巴巴20周年,我将不再担任阿里巴巴集\"},{\"words\":\"茧事局主席,现任阿里巴巴集团CEO张(逍遥子\"},{\"words\":\"将接任茚事局主席一职。我从今日起会全面配合张勇\"},{\"words\":\"为我们的组织过渡做好准备。在2019年9月10日之后\"},{\"words\":\"我将继续担任阿里巴巴集团革事会成员,直至2020年\"},{\"words\":\"这是我深思熟虑、认真准备了10年的计划,今天得以\"},{\"words\":\"实现,要感谢阿里巴巴合伙人的认同,感谢阿里巴巴茧事\"},{\"words\":\"局的批准,也要感谢所有阿里巴巴的同事们以及他们的\"},{\"words\":\"力,让我们有足够的自信和能力迎接这一天。这标志着阿\"},{\"words\":\"里巴巴完成了从依靠个人特质变成依靠组织机制、依靠\"},{\"words\":\"才文化的企业制度升级\"},{\"words\":\"1999年,和大家一起创办阿里巴巴的时候,我们矢志建\"},{\"words\":\"家让中国和世界骄傲的公司,让公司能够持久发展\"},{\"words\":\"102年。我们知道谁都不可能陪伴公司102年,公司持久\"},{\"words\":\"发展靠的是治理制度、文化体系和源源不断的人才梯队\"},{\"words\":\"司不可能只靠\"},{\"words\":\"人,更何况我深知从能力、精力\"},{\"words\":\"和体力的角度,任何人都不可能永远担任公司的CEO和\"},{\"words\":\"玉事长工作。10年前我们就问自己这个问题,如何保证马\"},{\"words\":\"离开公司以后,阿生巴巴依然健哀发展?我们相信只有\"},{\"words\":\"建立一套制度,形成一套独特的文化,音养和锻炼出一大\"},{\"words\":\"批人才的接班人体系,才能解开企业传承发展的难题。为\"},{\"words\":\"此,这十年来,我们从未停止过努力和实践\"},{\"words\":\"我受的教育让我成为一名教师,能够走到今天我非\"},{\"words\":\"常幸运。为公司未来负责也为白己负责,应该让公司里\"},{\"words\":\"更年轻、更有能力和才华的人来担任领导工作,继续传\"},{\"words\":\"承“让天下没有难做的生意”这个伟大的使命。我们帮\"},{\"words\":\"助全世界的中小企业、年轻人、妇女发展的使命和愿景\"},{\"words\":\"让我们潋动不已,这是我们的初心,也是我们的福\"},{\"words\":\"责任:真正相信并实现这样的使命就需要更多马云\"},{\"words\":\"数代阿里人去为之奋斗\"},{\"words\":\"今天的阿里巴巴最了不起的不是它的业务、规模和已经\"},{\"words\":\"取得的成绩,最了不起的是我们已经变成了一家真正使\"},{\"words\":\"愿景驱动的企业。我们创建的新型合伙人机制,我们独\"},{\"words\":\"特的文化和良将如潮的人才梯队,为公司传承打下坚实\"},{\"words\":\"旳制度基础。事实上,自2013年我交棒CEO开始,我们已\"},{\"words\":\"经靠这样的机制顺利运转了5年\"},{\"words\":\"我们创建的合伙人机制创造性地解决了观模公\"},{\"words\":\"创新力问题、领导人传承问题、未来担当力问题和文化\"},{\"words\":\"传承可题。这几年来,我亻\"},{\"words\":\"和完善我们的制度\"},{\"words\":\"和人才文化体系,单纯靠人或制度都不能解决问题,只\"},{\"words\":\"有制度和人、文化完美结合在一起,才能让公司健康持\"},{\"words\":\"久发展。我深信:今天阿里巴巴合伙人制度和阿里巴\"},{\"words\":\"巴所捍卫的文化,假以时日,将会越来越兢得客户、员\"},{\"words\":\"工和投东的支持和拥护\"},{\"words\":\"99年创始之日起,我们就提出未来的阿里巴巴必\"},{\"words\":\"要有“良将如潮”的人才团队和迭代发展的接班人体系\"},{\"words\":\"经过19年的努力:今天的阿里巴巴无论是人才的质晕和\"},{\"words\":\"数量都堪称世界一流。作为教师出身的我;看到我们今\"},{\"words\":\"天的团队、领导群体、以使命价值观驱动的独特文\"},{\"words\":\"以及不断涌现出的一大批以张勇为代表的杰出商业领袖\"},{\"words\":\"和专业人才,我深感自家!\"},{\"words\":\"张加入阿生巴巴已经十一年,自担任阿生巴巴集团\"},{\"words\":\"EO以来,展现出了卓越的尚业才华和坚定沉着的领导\"},{\"words\":\"力,连续13季度实现阿里巴巴业绩健康持续增长。他具有\"},{\"words\":\"超级计箅机般的逻辑和思考能力,坚信使命慮景,勇于担\"},{\"words\":\"当,全情投入,敢于站在未来创新设计新型商业模式和业\"},{\"words\":\"态。他被评为中国20\"},{\"words\":\"EO排名第一,这份荣誉\"},{\"words\":\"当之无愧!他和他的团队已经嬴得了客户、员工和股东们\"},{\"words\":\"的信任和支持。阿里巴巴的接力火炬交给他和他领导的\"},{\"words\":\"团队:我认为这是我现在最应该做的最正确决定。这几年\"},{\"words\":\"我和张勇的合作配合经历;让我对他和他领导的新一\"},{\"words\":\"阿里巴巴领导团队充满信心!\"},{\"words\":\"关于我自己未来的发展,我还有很多美好的梦想。大\"},{\"words\":\"知道我是闲不住的人,除了继续担任阿里巴巴合伙\"},{\"words\":\"人和为合伙人组织机制做努力和贡献外,我想回归教\"},{\"words\":\"育,做我热爱的事情会让我无比兴奋和幸福。再说了\"},{\"words\":\"世界那么大,趁我还年轻,很多事想试试,万一实现\"},{\"words\":\"呢?!我可以向大家承诺的是,阿里从来不只属于马\"},{\"words\":\"但马云会永\"},{\"words\":\"乙\"},{\"words\":\"2018年9月10日\"},{\"words\":\"内容标签\"},{\"words\":\"互联网级}0.60电子商务\"},{\"words\":\"阿里巴巴(2级)1.0\"}],\"words_result_num\":84}\n";
        JSONObject jsonObject = JSON.parseObject(result);
        JSONArray jsonArray = jsonObject.getJSONArray("words_result");
        for(Object js:jsonArray){
            JSONObject obj = (JSONObject) js;
            System.out.print(obj.getString("words"));
        }
        System.out.println();
    }
}
